Syllabus.org
#+TITLE: Syllabus
#+AUTHOR: Mitansh Panchal

* System Analysis and Design
** Jyoti Verma
*** System concepts & Information system environment:[0/8]
- [ ] System Concepts
- [ ] Definition
- [ ] Characteristics of a system
- [ ] Elements of Systems
- [ ] Introduction to systems analysis and design
- [ ] System analysis
- [ ] System Design
- [ ] System Development Life Cycle

*** System Planning And Investigation [0/13]
- [ ] Where does the system analyst come form?
- [ ] What does he do?
- [ ] Preparating for case as a system analyst
- [ ] Technical Skills
- [ ] Communication Skills
- [ ] Role of System Analyst
- [ ] Change agent
- [ ] Investigation and monitor
- [ ] Phychologist
- [ ] Sales person
- [ ] Motivator
- [ ] Politician plan of the system analyst
- [ ] Position in the MIS organisation

*** File organisation
*** System Testing [0/8]
- [ ] System testing conversion
- [ ] Combating resistance to change
- [ ] past implementation
- [ ] Review
- [ ] Software maintenance
- [ ] Hardware/Software selection
- [ ] Security disaster / Recovery
- [ ] Ethics in System Development

** Khushbu Panchal [/]
- [ ] Feasibility Study
- [ ] Types of Analysis
- [ ] Constbenifit Analysis
- [ ] The Process And Stages of System Design
- [ ] System Design
- [ ] HIPO and IPO Charts
- [ ] Tools of Structured Analysis

* Programming In Java
** Ruchita Tailor (Herbert Schildt except Java applet) [0/6]
- [ ] Chapter 3 : Data Types, Variables, and Arrays
- [ ] Chapter 5 : Control Statement
- [ ] Chapter 7 : A closer Look at Methods and Classes
- [ ] Chapter 8 : Inheritance
- [ ] Chapter 9 : Packages and Interfaces
- [ ] Java Applets PDF

* Rational Database and Management Systems
** Ruchita Tailor [/]
- [ ] Unit 1 : Introduction To RDBMS
- [ ] Unit 2 : Data Architecture
- [ ] Unit 3 : Data Models
- [ ] Normalization
- [ ] Chap 7 : Relational Data Model
- [ ] Chap 8 : Relational Algebra
- [ ] Chap 9 : Functional Dependency

** Khushbu Panchal [/]
- [ ] SQL Operators
- [ ] Definitions
- [ ] Functions
- [ ] Grant and Revoke
- [ ] Index
- [ ] Joins
- [ ] Relational Algebra
- [ ] Oracle Basic Query
- [ ] View

* Computer Networks
** Ruchita Tailor [/]
- [ ] Network Security
- [ ] Cryptography
- [ ] DNS

** Khushbu Panchal [/]
- [ ] Network Interface Card (NIC)
- [ ] Software for network

** Jyoti Verma [/]
- N/A

* Fundamentals Of Operating System
** Ruchita Tailor [/]
- [ ] Unit 1 : Introduction to OS
- [ ] Unit 2 : Process Management And Threads
- [ ] Unit 3 : IPC (Inter Process Communication)
- [ ] Memory Management
- [ ] File Management
