Syllabus.tex
% Created 2022-03-20 Sun 23:17
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Mitansh Panchal}
\date{\today}
\title{Syllabus}
\hypersetup{
 pdfauthor={Mitansh Panchal},
 pdftitle={Syllabus},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{System Analysis and Design}
\label{sec:org961a418}
\subsection{Jyoti Verma}
\label{sec:orgd143caf}
\subsubsection{System concepts \& Information system environment:}
\label{sec:org3d3a5e5}
\begin{itemize}
\item[{$\square$}] System Concepts
\item[{$\square$}] Definition
\item[{$\square$}] Characteristics of a system
\item[{$\square$}] Elements of Systems
\item[{$\square$}] Introduction to systems analysis and design
\item[{$\square$}] System analysis
\item[{$\square$}] System Design
\item[{$\square$}] System Development Life Cycle
\end{itemize}

\subsubsection{System Planning And Investigation}
\label{sec:org1e4e778}
\begin{itemize}
\item[{$\square$}] Where does the system analyst come form?
\item[{$\square$}] What does he do?
\item[{$\square$}] Preparating for case as a system analyst
\item[{$\square$}] Technical Skills
\item[{$\square$}] Communication Skills
\item[{$\square$}] Role of System Analyst
\item[{$\square$}] Change agent
\item[{$\square$}] Investigation and monitor
\item[{$\square$}] Phychologist
\item[{$\square$}] Sales person
\item[{$\square$}] Motivator
\item[{$\square$}] Politician plan of the system analyst
\item[{$\square$}] Position in the MIS organisation
\end{itemize}

\subsubsection{File organisation}
\label{sec:orgf25cc27}
\subsubsection{System Testing}
\label{sec:orgdbde862}
\begin{itemize}
\item[{$\square$}] System testing conversion
\item[{$\square$}] Combating resistance to change
\item[{$\square$}] past implementation
\item[{$\square$}] Review
\item[{$\square$}] Software maintenance
\item[{$\square$}] Hardware/Software selection
\item[{$\square$}] Security disaster / Recovery
\item[{$\square$}] Ethics in System Development
\end{itemize}

\subsection{Khushbu Panchal}
\label{sec:org02c4053}
\begin{itemize}
\item[{$\square$}] Feasibility Study
\item[{$\square$}] Types of Analysis
\item[{$\square$}] Constbenifit Analysis
\item[{$\square$}] The Process And Stages of System Design
\item[{$\square$}] System Design
\item[{$\square$}] HIPO and IPO Charts
\item[{$\square$}] Tools of Structured Analysis
\end{itemize}

\section{Programming In Java}
\label{sec:orgbed6373}
\subsection{Ruchita Tailor (Herbert Schildt except Java applet)}
\label{sec:org99314b0}
\begin{itemize}
\item[{$\square$}] Chapter 3 : Data Types, Variables, and Arrays
\item[{$\square$}] Chapter 5 : Control Statement
\item[{$\square$}] Chapter 7 : A closer Look at Methods and Classes
\item[{$\square$}] Chapter 8 : Inheritance
\item[{$\square$}] Chapter 9 : Packages and Interfaces
\item[{$\square$}] Java Applets PDF
\end{itemize}

\section{Rational Database and Management Systems}
\label{sec:orgc9bf215}
\subsection{Ruchita Tailor}
\label{sec:org472295a}
\begin{itemize}
\item[{$\square$}] Unit 1 : Introduction To RDBMS
\item[{$\square$}] Unit 2 : Data Architecture
\item[{$\square$}] Unit 3 : Data Models
\item[{$\square$}] Normalization
\item[{$\square$}] Chap 7 : Relational Data Model
\item[{$\square$}] Chap 8 : Relational Algebra
\item[{$\square$}] Chap 9 : Functional Dependency
\end{itemize}

\subsection{Khushbu Panchal}
\label{sec:org3b0094f}
\begin{itemize}
\item[{$\square$}] SQL Operators
\item[{$\square$}] Definitions
\item[{$\square$}] Functions
\item[{$\square$}] Grant and Revoke
\item[{$\square$}] Index
\item[{$\square$}] Joins
\item[{$\square$}] Relational Algebra
\item[{$\square$}] Oracle Basic Query
\item[{$\square$}] View
\end{itemize}

\section{Computer Networks}
\label{sec:org1f17f46}
\subsection{Ruchita Tailor}
\label{sec:org74dbc64}
\begin{itemize}
\item[{$\square$}] Network Security
\item[{$\square$}] Cryptography
\item[{$\square$}] DNS
\end{itemize}

\subsection{Khushbu Panchal}
\label{sec:orgcc61aa2}
\begin{itemize}
\item[{$\square$}] Network Interface Card (NIC)
\item[{$\square$}] Software for network
\end{itemize}

\subsection{Jyoti Verma}
\label{sec:org69d64ed}
\begin{itemize}
\item N/A
\end{itemize}

\section{Fundamentals Of Operating System}
\label{sec:org4468140}
\subsection{Ruchita Tailor}
\label{sec:org4571e70}
\begin{itemize}
\item[{$\square$}] Unit 1 : Introduction to OS
\item[{$\square$}] Unit 2 : Process Management And Threads
\item[{$\square$}] Unit 3 : IPC (Inter Process Communication)
\item[{$\square$}] Memory Management
\item[{$\square$}] File Management
\end{itemize}
\end{document}
